package testpm;

public class Test10 {

	public static void main(String[] args) {
	        // 팀에서 타자 게임의 컨셉을 설계합니다. 
	        // 다음 내용은 예시 입니다.

	       //단어 타자 게임
	       // 1차원 배열에 게임에서 사용할 문자열을 저장한다. 엔터키를 누르면 게임이 시작되고, 
	       // 랜덤한 단어가 제시된다.
	       // 단어가 제시되면 키보드로 단어를 입력한다.
	       // 제시된 단어와 키보드로 입력된 단어로 채점을 한다. (채점에 대한 기준은 조에서 기준 마련)
	       // <채점 기준 예시> 100맞아야 점수 인정, 부분점수 부여
	       // <선택>게임의 재미를 위해 연속적으로 단어 3개를 100% 맞춘다면 보너스 점수 부여
	       // <선택>팀별 아이디어 추가

	       // 단어 블록 깨기
	       // 1차원 배열 3개를 만든다.       
	       // 총3개의 1차원 배열에 모든 단어를 저장하여 출력한다. 
	       // 단어는 중복될 수 있다.
	       // 사용자는 단어를 입력한다. 
	       // 입력된 단어와 제시된 단어가 일치 하는 단어의 블록을 제거한다.
	       //  (중복된 단어는 모두 제거)


	//산출물 : java소스(개별), 프로젝트 ppt(개별)
	//산출물 부가 설명 : java 소스는 주석(개발날짜 및 개발자 작성, 변수 설명, for문  설명)
	//                        ppt는 메인표지, 주요기능소개, 기능별 알고리즘 소개, 실행화면, 후기 <실행영상촬영>
	//                        ppt는 10페이지를 넘지 않는다.



	}

}
